Tekla.Structures.Model.ControlLine.ControlLineColorEnum
The different line colors.

Tekla.Structures.Model.ControlLine.ControlLineColorEnum.YELLOW_RED
The yellow/red color.

Tekla.Structures.Model.ControlLine.ControlLineColorEnum.BLACK
The black color.

Tekla.Structures.Model.ControlLine.ControlLineColorEnum.WHITE
The white color.

Tekla.Structures.Model.ControlLine.ControlLineColorEnum.RED
The red color.

Tekla.Structures.Model.ControlLine.ControlLineColorEnum.GREEN
The green color.

Tekla.Structures.Model.ControlLine.ControlLineColorEnum.BLUE
The blue color.

Tekla.Structures.Model.ControlLine.ControlLineColorEnum.CYAN
The cyan color.

Tekla.Structures.Model.ControlLine.ControlLineColorEnum.YELLOW
The yellow color.

Tekla.Structures.Model.ControlLine.ControlLineColorEnum.MAGENTA
The magenta color.